# YOLOv5 🚀 by Ultralytics, AGPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [1,1, 1,3, 3,2]  # P3/8
  - [1,1, 1,3, 3,2]  # P3/8

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, BFF, [64]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 1, BFF, [128]],  # 0-P1/2
   [-1, 3, C3, [128]],   # 4
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, C3, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 9 11
  ]

# YOLOv5 v6.0 head
head:
  [[[-1, 8, 6], 1, QueenFusion, [1024, 512]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 13

   [[-1, 6, 4], 1, QueenFusion, [512, 384]],  # cat backbone P4
   [[11, 8, 6, 4], 1, FAM_IFM, []],  # cat backbone P4
   [[-2, -1], 1, InjectionMultiSum_Auto_pool, []],  # cat backbone P4
   [-1, 3, C3, [384, False]],  # 17 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],
   [13, 1, Conv, [256, 1, 1]],
   [[-1, -2], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 21 (P4/16-medium)

   [[17, 21], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
